import { Member } from '../types/member';

export const membersData: Member[] = [
  {
    id: 1,
    title: '代表',
    name: '丹羽 勝麻',
    nameEn: 'Niwa Katsuma',
    imageUrl: 'https://placehold.co/400x500/FFE0E0/FF5252?text=K.N',
    social: { x: 'https://twitter.com/example1' },
    bio: '1998年滋賀県で生まれ、その後東京理科大学経営学部を卒業する。自身の幼少期の経験や現在も抱える愛着問題をもとに、事業を立ち上げようとSweptを結成。',
    thoughts: '行って みよう 二 人 は 、 もと の 車室 の 席 に 、 ぬれ た よう な ふう に なり まし た 。 みなさん は 夜 に この ま ん 中 に 立っ て いる の でし た 。 けれども いつ でも 家 じゅう まだ し いん と し て 誰 も い ませ ん でし た 。 見 る と 鳥 捕り は 、 すっかり 注文 通り だ という よう に 、 天の川 の 水 を 、 見きわめよ う と し まし た 。 ジョバンニ は すぐ うしろ の 天気 輪 の 柱 の 向こう に 三つ の 三角 標 の 形 に 書い た 大きな 図 が かかっ て い ました 。',
    slug: 'niwa-katsuma'
  },
  {
    id: 2,
    title: 'マネージャー',
    name: '住岡 真穂',
    nameEn: 'Sumioka Maho',
    imageUrl: 'https://placehold.co/400x500/E0F2F7/00ACC1?text=M.S',
    social: { x: 'https://twitter.com/example2' },
    bio: '1998年大阪府で生まれ、その後京都大学大学院農学研究科修士課程を修了する。代表の丹羽とは小学生時代の学習塾で知り合う。親族の会社で働いていた彼をサポートする中で、愛着問題と深く向き合うことになり、それまで直面することのなかった愛着という問題に深く悩むようになる。同じような問題を抱える人たちの助けになりたいという思いから、Sweptへの参画を決意する。',
    thoughts: '行って みよう 二 人 は 、 もと の 車室 の 席 に 、 ぬれ た よう な ふう に なり まし た 。 みなさん は 夜 に この ま ん 中 に 立っ て いる の でし た 。 けれども いつ でも 家 じゅう まだ し いん と し て 誰 も い ませ ん でし た 。 見 る と 鳥 捕り は 、 すっかり 注文 通り だ という よう に 、 天の川 の 水 を 、 見きわめよ う と し まし た 。 ジョバンニ は すぐ うしろ の 天気 輪 の 柱 の 向こう に 三つ の 三角 標 の 形 に 書い た 大きな 図 が かかっ て い ました 。',
    slug: 'sumioka-maho'
  },
  {
    id: 3,
    title: 'デザイナー',
    name: '豊島 昇悟',
    nameEn: 'Toyoshima Shogo',
    imageUrl: 'https://placehold.co/400x500/E8F5E9/4CAF50?text=S.T',
    social: { x: 'https://twitter.com/example3' },
    bio: '1999年埼玉県で生まれ、その後東京理科大学経営学部を卒業する。代表の丹羽とは大学時代に囲碁部で知り合う。デザインに興味を持ち学ぶ中で、スタートアップ事業への関心が芽生えたこと、また、丹羽との関わりを通じて自身の家庭環境や愛着に関する課題を認識したことから、Sweptへの参画を決意する。',
    thoughts: '行って みよう 二 人 は 、 もと の 車室 の 席 に 、 ぬれ た よう な ふう に なり まし た 。 みなさん は 夜 に この ま ん 中 に 立っ て いる の でし た 。 けれども いつ でも 家 じゅう まだ し いん と し て 誰 も い ませ ん でし た 。 見 る と 鳥 捕り は 、 すっかり 注文 通り だ という よう に 、 天の川 の 水 を 、 見きわめよ う と し まし た 。 ジョバンニ は すぐ うしろ の 天気 輪 の 柱 の 向こう に 三つ の 三角 標 の 形 に 書い た 大きな 図 が かかっ て い ました 。',
    slug: 'toyoshima-shogo'
  },
]; 